# operand
# นำข้อมูลเปรียบเทียบกัน **ต้องชนิดเดียวกัน**
# คำตอบ คือ Boolean

x=int(input("Num 1 : "))
y=int(input("Num 2 : "))
z=int(input("Num 3 : "))

#print("ค่า x มากกว่า y หรือไม่ : ", x>y)
#print("ค่า x น้อยกว่า y หรือไม่ : ", x<y)
#print("ค่า x เท่ากับ y หรือไม่ : ", x==y)
#print("ค่า x ไม่เท่ากับ y หรือไม่ : ", x!=y)
#print("ค่า x มากกว่าเท่ากับ y หรือไม่ : ", x>=y)
#print("ค่า x น้อยกว่าเท่ากับ y หรือไม่ : ", x<=y)

#และ
print("ค่า x มากกว่า y และ y มากกว่า z หรือไม่ : " ,x>y>z)
print("ค่า x มากกว่า y และ y มากกว่า z หรือไม่ : " ,x<y>z)